tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# Better versions of Mac built-ins
brew "bash"
brew "gnu-sed"
brew "rsync"
brew "the_silver_searcher"

# Bash completions
brew "bash-completion@2"
brew "django-completion"
brew "pip-completion"
brew "yarn-completion"

# General development
brew "act"
brew "automake"
brew "bfg"
brew "ctop"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "hadolint"
brew "universal-ctags"

# Node
brew "nvm"

# React develoment (jest)
brew "watchman"

# Python development
brew "gdbm"
brew "pyenv", args: ["HEAD"]
brew "pyenv-virtualenvwrapper"

# pyenv recommended
brew "readline"
brew "sqlite"
brew "xz"
brew "zlib"

# pyenv 3.6 install workaround
# https://stackoverflow.com/a/66483524
brew "bzip2"

# Ruby development
brew "chruby"
brew "libyaml"
brew "ruby-install"

# Needed for magic
brew "libmagic"

# More nice-to-haves and various development tools
brew "autojump"
brew "bat"
brew "diff-pdf"
brew "direnv"
brew "dive"
brew "exa"
brew "graphviz"
brew "httpie"
brew "jq"
brew "m-cli"
brew "multimarkdown"
brew "openssl"
brew "pandoc"
brew "pwgen"
brew "qpdf"
brew "shellcheck"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "starship"
brew "swig"
brew "tmate"
brew "tmux"
brew "trash"
brew "tree"
brew "wdiff"
brew "wget"

# tmux copy and paste
brew "reattach-to-user-namespace"

# tmux PAM reattch for Touch ID
brew "pam-reattach"

# Needed for node sharp (personal-site)
brew "libvips"

# Quick Look plugins
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"

# Apps
cask "1password", greedy: true
cask "alfred", greedy: true
cask "appcleaner"
cask "bartender", greedy: true
cask "brave-browser", greedy: true
cask "carbon-copy-cloner", greedy: true
cask "cheatsheet"
cask "coconutbattery"
cask "cyberduck"
cask "daisydisk"
cask "docker", greedy: true
cask "duet", greedy: true
cask "encryptme"
cask "evernote"
cask "firefox", greedy: true
cask "fsnotes", greedy: true
cask "google-chrome"
cask "istat-menus", greedy: true
cask "keepingyouawake"
cask "mactracker"
cask "macvim", greedy: true
cask "marked", greedy: true
cask "menuwhere"
cask "messenger"
cask "micro-snitch"
cask "ngrok"
cask "onyx"
cask "p4v", greedy: true
cask "pester"
cask "screenflow"
cask "skitch"
cask "slack", greedy: true
cask "soundsource", greedy: true
cask "sourcetree", greedy: true
cask "taskpaper"
cask "the-unarchiver"
cask "toggl-track", greedy: true
cask "tripmode"
cask "tweetbot"
cask "vlc"
cask "whatsapp"

# Fonts
tap "homebrew/cask-fonts"
cask "font-input"
cask "font-sauce-code-pro-nerd-font"

## Other potential font options
# cask "font-anonymice-nerd-font"
# cask "font-blex-mono-nerd-font"
# cask "font-caskaydia-cove-nerd-font"
# cask "font-droid-sans-mono-nerd-font"
# cask "font-fira-mono-nerd-font"
# cask "font-hasklug-nerd-font"
# cask "font-inconsolata-lgc-nerd-font"
# cask "font-jetbrains-mono-nerd-font"

# Dequency
tap "bbc/audiowaveform"
brew "audiowaveform"
brew "flyctl"
cask "amazon-chime"
cask "dbeaver-community", greedy: true
cask "discord"
cask "figma"
cask "notion"
cask "zoom", greedy: true
