tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"

# Better versions of Mac built-ins
brew "bash"
brew "colordiff"
brew "gnu-sed"
brew "rsync"
brew "the_silver_searcher"

# Bash completions
brew "bash-completion@2"
brew "django-completion"
brew "pip-completion"
brew "yarn-completion"

# General development
brew "automake"
brew "bfg"
brew "ctop"
brew "gh"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "hadolint"
brew "universal-ctags"

# GitHub Actions
brew "act"

# Node
brew "nvm"

# React develoment (jest)
brew "watchman"

# Python development
brew "gdbm"
brew "pyenv"
brew "pyenv-virtualenvwrapper"

# pyenv recommended
brew "readline"
brew "sqlite"
brew "xz"
brew "zlib"

# pyenv 3.6 install workaround
# https://stackoverflow.com/a/66483524
brew "bzip2"

# pdftotext
brew "pkg-config"
brew "poppler"

# Ruby development
brew "chruby"
brew "libyaml"
brew "ruby-install"

# Needed for magic
brew "libmagic"

# More nice-to-haves and various development tools
brew "autojump"
brew "diff-pdf"
brew "direnv"
brew "dive"
brew "exa"
brew "graphviz"
brew "httpie"
brew "jq"
brew "multimarkdown"
brew "openssl"
brew "pandoc"
brew "qpdf"
brew "shellcheck"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "swig"
brew "tmate"
brew "tmux"
brew "trash"
brew "tree"
brew "wdiff"
brew "wget"

# tmux copy and paste
brew "reattach-to-user-namespace"

# tmux PAM reattch for Touch ID
brew "pam-reattach"

# Quick Look plugins
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"

# Apps
cask "alfred"
cask "appcleaner"
cask "bartender"
cask "boop"
cask "brave-browser"
cask "carbon-copy-cloner"
cask "cheatsheet"
cask "coconutbattery"
cask "cyberduck"
cask "daisydisk"
cask "docker"
cask "duet"
cask "encryptme"
cask "evernote"
cask "firefox"
cask "fsnotes"
cask "google-chrome"
cask "istat-menus"
cask "keepingyouawake"
cask "mactracker"
cask "macvim"
cask "marked"
cask "menuwhere"
cask "messenger"
cask "micro-snitch"
cask "ngrok"
cask "onyx"
cask "p4v"
cask "pester"
cask "screenflow"
cask "skitch"
cask "slack"
cask "soundsource"
cask "sourcetree"
cask "taskpaper"
cask "the-unarchiver"
cask "toggl-track"
cask "tripmode"
cask "tweetbot"
cask "vlc"
cask "whatsapp"

# Color calibration
cask "displaycal"

# https://github.com/apparition47/MailTrackerBlocker
tap "apparition47/tap"
cask "mailtrackerblocker"

# Dequency
cask "amazon-chime"
cask "figma"
cask "notion"
cask "zoom"

# EDB
cask "miro"
cask "openconnect-gui"
cask "wkhtmltopdf"

# Techtonica
tap "heroku/brew"
brew "heroku"
cask "dbeaver-community"

# Workaround for vim TabNine/YouCompleteMe which requires Python 3.9
brew "python@3.9"
