tap "buo/cask-upgrade"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "universal-ctags/universal-ctags"

# Better versions of Mac built-ins
brew "bash"
brew "colordiff"
brew "gnu-sed"
brew "rsync"
brew "the_silver_searcher"

# Bash completions
brew "bash-completion@2"
brew "brew-cask-completion"
brew "django-completion"
brew "docker-completion"
brew "docker-compose-completion"
brew "pip-completion"
brew "yarn-completion"

# General development
brew "automake"
brew "bfg"
brew "ctop"
brew "git"
brew "git-delta"
brew "git-lfs"
brew "hadolint"
brew "universal-ctags/universal-ctags/universal-ctags", args: ["HEAD"]

# GitHub Actions
tap "nektos/tap"
brew "nektos/tap/act"

# Node
brew "nvm"

# React develoment (jest)
brew "watchman"

# Python development
brew "gdbm"
brew "pyenv"
brew "pyenv-virtualenvwrapper"

# pyenv recommended
brew "readline"
brew "sqlite"
brew "xz"
brew "zlib"

# Ruby development
brew "chruby"
brew "libyaml"
brew "ruby-install"

# Needed for magic
brew "libmagic"

# More nice-to-haves and various development libraries
brew "autojump"
brew "direnv"
brew "dos2unix"
brew "exa"
brew "graphviz"
brew "httpie"
brew "jq"
brew "macvim"
brew "multimarkdown"
brew "openssl"
brew "pandoc"
brew "qpdf"
brew "shellcheck"
brew "speedtest-cli"
brew "ssh-copy-id"
brew "swig"
brew "tmate"
brew "tmux"
brew "trash"
brew "tree"
brew "wdiff"
brew "wget"

# tmux copy and paste
brew "reattach-to-user-namespace"

# tmux PAM reattch for Touch ID
tap "fabianishere/personal"
brew "fabianishere/personal/pam_reattach"

# Quick Look plugins
cask "qlimagesize"
cask "qlmarkdown"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-json"

# Apps
cask "alfred"
cask "appcleaner"
cask "arq"
cask "bartender"
cask "cheatsheet"
cask "coconutbattery"
cask "cyberduck"
cask "discord"
cask "docker"
cask "duet"
cask "encryptme"
cask "firefox"
cask "fluid"
cask "focusatwill"
cask "fsnotes"
cask "google-chrome"
cask "istat-menus"
cask "keepingyouawake"
cask "krisp"
cask "mactracker"
cask "markdown-service-tools"
cask "microsoft-edge"
cask "ngrok"
cask "onyx"
cask "p4v"
cask "pester"
cask "skitch"
cask "skype"
cask "slack"
# cask "soundsource"
cask "sourcetree"
cask "taskpaper"
cask "the-unarchiver"
cask "toggl"
cask "tripmode"
cask "vlc"
cask "whatsapp"

# Color calibration
cask "displaycal"

# fonts
tap "homebrew/cask-fonts"
cask "font-input"

# BTC
cask "browserstacklocal"

# EDB
cask "openconnect-gui"
cask "zoomus"
